window.Text = {
	gameName: 'درع العرب',
	towers : '',
  payments : {
    daopay : {
      description : 'ادفع عن طريق الموبايل بسرعة وسهولة وأمان وبدون الحاجة إلى بطاقة ائتمان',
      packageCommand : 'ادفع *price* EUR وأحصل على *reward* من النقود'
    },
    success : 'مبروك, لقد قمت بشراء *coins* من النقود بنجاح',
    contactUsMessage : 'For any issue, please',
    contactUsTrigger : 'contact us',
    contactUsFormTitle : 'Explain your issue :',
    contactUsFormSend : 'Send',
	makeSure :'تأكد من انتهاء المكالمه',
    contactUsFormPostSubmissionSuccess : 'We will revise your issue soon. Thanks you for your patience.',
    contactUsFormPostSubmissionFailure : 'Your issue is not posted successfully, please try again later.'
  },
	superWeapons : '',
    intro : {
        levelSelection : {
            msg : 'دافع عن بلد جديد كل أسبوع',
            title : 'التحدي الإسبوعي',
            extraMaps : 'الحملات السابقة',
            tutorial : 'الآكاديمية الحربية',
            easy : 'سهل',
            medium : 'متوسط',
            hard : 'صعب',
            score : 'X النقاط'
        },
        campaign : {
            back : 'ارجع'          
        },
        mission : {
            msg : 'معلومات استخباراتية:',
            accept : 'موافق',
            or : 'أو',
            goBack : 'ارجع إلى البلد'
        },
        marketPlace : {
            add : 'اشتري',
            money : 'نقود',
            addWeapon : 'اشتري أو طور اسلحتك الخاصة',
            addTower : 'اشتري أو طور مدافعك',
            back : 'ارجع',
            ready : 'مستعد',
            unlock : 'اشتري',
            upgrade : 'طور',
            requiredRank : 'الرتبة المطلوبة'
        },
        creeps : {
            BlackTank : {
                name : 'أ 30 افينجر',
                desc : 'دبابة ثقيلة ليس من السهل تدميرها وتستطيع الهرب في المواقف الصعبة' 
            },
            RedTank : {
                name : 'م 18 هيلكات',
                desc : 'تتميز هذه الدبابة بقوة تدميرها العالية ويمكن ان تسبب دمارا هائلا' 
            },
            Tank : {
                name : 'م 48 باتون',
                desc : 'دبابة أساسية في الحروب وتستخدم في الاساس في عمليات الدعم' 
            },
            TankI : {
                name : 'م 42 دستر',
                desc : 'دبابة متوسطة القوة تستخدم للدعم أو المناورات' 
            },
            TankII : {
                name : 'م 41 والكر',
                desc : 'دبابة خفيفة تتميز بسرعتها العالية حيث تستطيع التحرك أسرع من أي دبابة أخرى' 
            },
            Humvee : {
                name : 'همفي',
                desc : 'مركبة متعددة الوظائف لها القدرة على الحركة في جميع أنواع الأراضي'
            },
            RedPlane :{
                name : 'ف 22 رابتر',
                desc : 'تعتبر هذه الطائرة من أقوى الطائرات الموجودة في العالم حيث تمتاز بسرعتها العالية وقوة تدميرها'
            },
            Plane : {
                name : 'ف 15 إيجل',
                desc : 'تمتاز هذه الطائرة بقدرتها على المناورة للسيطرة على المعارك الجوية'
            }
        },
        superWeapons : {
            Splash : { 
                name : 'غارة',
                desc : 'يرسل 10 صواريخ بحد اقصى تستهدف أكبر 10 وحدات من العدو' 
            },
            Weak : {  
                name : 'إضعاف',
                desc : 'يقلل من نقاط قوة العدو بمرور الوقت' 
            },
            Hyper : { 
                name : 'سرعة',
                desc : 'يزيد من سرعة اطلاق جميع مدافعك' 
            },
            Nuke : {  
                name : 'نووي',
                desc : 'يرسل قنبلة نووية تدمر جميع الأعداء على الخريطة' 
            },
            Heal : {  
                name : 'اصلاح',
                desc : 'يصلح جميع مدافعك بزيادة نسبة مئوية من نقاط قوتهم' 
            }
        },
        towers : {
            Belcher : {  
                name : 'بدر 1', 
                desc : 'مدفع سريع الطلقات قصير المدى ويحتوي على ماسورة اطلاق واحدة' + 
                       '  ويمكن ان يستخدم كمضاد للدبابات والطائرات.' +
                       ' يستخدم الرصاص كذخيرة أساسية ولا يوجد به أي جهاز توجيه' 
            },
            Reaper : {
                name : 'بدر 2',
                desc : 'يعتبر بدر 2 نسخة مطورة من مدفع بدر 1' + 
                         ' يحتوي على ماسورتين اطلاق مما يضاعف معدل اطلاقه للنيران عنه لدى بدر 1' + 
                         ' ويعتبر هذا المدفع أكثر فاعلية من بدر 1 ضد وحدات العدو' 
            },
            Patriot : { 
                name : 'صقر',
                desc : 'مدفع صواريخ أرض جو بعيدة المدى' + 
                       ' يستخدم كدفاع جوي ضد طائرات العدو' +
                       ' ولديه نظام اعتراض صاروخي موجه عن طريق رادار عالي الدقة لتدمير اهدافه' 
            },
            Exploder : {
                name : 'شهاب',
                desc : 'مدفع صواريخ أرض أرض' +
                       ' يستخدم كمضاد لجميع الدبابات الثقيلة.' +
                       ' ولديه نظام رادار لإستهداف الوحدات الأرضية لتدميرها' 
           }
        },
        upgrades : {
            power : 'تدمير',
            rate : 'سرعة',
            range : 'مدى',
            maxHp : 'نقاط القوة',
            Heal : [ 
                    'يعيد 20% من نقاط القوة. يمكن اعادة استخدامه كل 90 ثانية',
					'يعيد 40%من نقاط القوة. يمكن اعادة استخدامه كل 90 ثانية',
					'يعيد 60%من نقاط القوة. يمكن اعادة استخدامه كل 90 ثانية',
                    'يعيد 80%من نقاط القوة. يمكن اعادة استخدامه كل 90 ثانية',
                    'يعيد 100%من نقاط القوة. يمكن اعادة استخدامه كل 90 ثانية'
                ],
            Weak : [
                    'يقلل 10% من نقاط قوة العدو الحالية لمدة 10 ثواني. يمكن اعادة استخدامه كل 60 ثانية',
					'يقلل 10% من نقاط قوة العدو الحالية لمدة 15 ثانية. يمكن اعادة استخدامه كل 60 ثانية',
					'يقلل 15% من نقاط قوة العدو الحالية لمدة 15 ثانية. يمكن اعادة استخدامه كل 60 ثانية',
                    'يقلل 15% من نقاط قوة العدو الحالية لمدة 20 ثانية. يمكن اعادة استخدامه كل 60 ثانية',
                    'يقلل 20% من نقاط قوة العدو الحالية لمدة 20 ثانية. يمكن اعادة استخدامه كل 60 ثانية'
                ],
            Nuke : [
                    'يمكن اعادة استخدامه كل 240 ثانية', 
                    'يمكن اعادة استخدامه كل 180 ثانية',
                    'يمكن اعادة استخدامه كل 120 ثانية'
                ],
            Splash : [
                    'قوة التدمير تساوي 20% من نقاط قوة العدو. يمكن اعادة استخدامه كل 120 ثانية',
					'قوة التدمير تساوي 40% من نقاط قوة العدو. يمكن اعادة استخدامه كل 120 ثانية',
					'قوة التدمير تساوي 60% من نقاط قوة العدو. يمكن اعادة استخدامه كل 120 ثانية',
                    'قوة التدمير تساوي 80% من نقاط قوة العدو. يمكن اعادة استخدامه كل 120 ثانية',
                    'قوة التدمير تساوي 100% من نقاط قوة العدو. يمكن اعادة استخدامه كل 120 ثانية'
                ],
            Hyper : [
                    'يزيد من سرعة اطلاق المدفع بنسبة 50% لمدة 10 ثواني. يمكن اعادة استخدامه كل 120 ثانية',
					'يزيد من سرعة اطلاق المدفع بنسبة 50% لمدة 20 ثانية. يمكن اعادة استخدامه كل 120 ثانية',
					'يزيد من سرعة اطلاق المدفع بنسبة 100% لمدة 20 ثانية. يمكن اعادة استخدامه كل 120 ثانية',
                    'يزيد من سرعة اطلاق المدفع بنسبة 100% لمدة 25 ثانية. يمكن اعادة استخدامه كل 120 ثانية',
                    'يزيد من سرعة اطلاق المدفع بنسبة 100% لمدة 30 ثانية. يمكن اعادة استخدامه كل 120 ثانية'
                ]
        }
    },
    facebook : {
        completeMession: [
              'دافع بشجاعة عن',
              'في',
               '',
              'دافع ببطولة عن المدينة وحصل على',
              'نقطة. هل يمكنك ان تحطم هذا الرقم؟'
        ],
        completeCampaign: [
              'بدفاع أسطوري أنقذ',
              'في',
              'اظهر دفاع بطولي لإنقاذ', 
              'وحصل على',
              'نقطة خلال رحلة الدفاع. هل يمكنك تحقيق هذا الانجاز؟'
        ],
        rankPromotion: [
              'تمت ترقيته ليصبح',
              'في',
              'تقديرا لمهاراته الدفاعية في',
              'تمت ترقيته ليصبح',
              '. نهنئه لشجاعته ومجهوداته العظيمة'
        ],
        unlockItem: [
              'اشترى',
              'في',
              'اشترى',
              'ليحصل على ميزة اضافية في المعارك'
        ],
        campaignRanking: [
            'أنهى في المركز',
            'بين اصدقاؤه و',
            'بين جميع اللاعبين خلال دفاعه عن',
            'في',
            'حصل على المركز',
            'بين اصدقاؤه و المركز',
            'بين جميع اللاعبين خلال رحلة دفاعه عن',
            '. هل يمكنك ان تحطم هذا الرقم؟'
        ],
        upgradeItem: [
            'طور',
            'في',
            'طور',
            'ليحصل على ميزة اضافية في المعارك'
        ],
        userPrompt : 'أخبر اصدقائك عن انجازك ',
		invite : {
            inviteMsg : 'هل انت شجاع بما فيه الكفاية للدفاع عن اراضى العرب ؟ ',
            userPrompt : 'ادع اصدقاؤك و اكسب 500 من النقود لكل صديق يبدأ اللعب'
        },
        like : '.مبروك ، لقد كسبت 500 من النقود الاعجابك بنا',
        bookmark : 'مبروك، لقد كسبت 500 من النقود كهدية الاضافتك لنا الى قائمة اشاراتك',
        subscribe : 'مبروك، لقد كسبت 500 من النقود كهدية الاضافتك لنا الى قائمة اشاراتك'
    },
	game : {
		tutorial : {
				msg1: 'أهلا بك في اكاديمية الدفاع'
		+'<br/>خلال فترة التدريب سوف  تحصل على المعلومات اللازمة و تكتسب المهارات الأساسية المطلوبة'
		+' لتتمكن من الدفاع عن مدينتك ضد أي اعتداءات',
				msg2: '</br>سيكون هدفك هو تدمير جميع وحدات العدو ومنعها من الوصول إلى المدينة',
				msg3: 'يمكنك متابعة رتبتك الحالية من خلال العلامة الموجودة أعلى يمين الشاشة </br>'
		+'<br/>يمكنك أيضًا متابعة مجموع نقاطك وعدد الوحدات المتبقية ومدى تقدمك في الرتبة'
		+' من خلال الشريط الموجود أعلى الشاشة</br>',
				msg4: 'و الان حان الوقت لوضع بعض المدافع. اضغط على مدفع بدر الموجود في مربع المدافع<br/>'
		+'لاحظ ظهور المعلومات الخاصة بالمدفع بعد الضغط عليه في المربع الخاص بالمعلومات',
				msg5: 'اضغط هنا لوضع المدفع في هذا المكان',
				msg6: 'أضف المزيد من المدافع طالما تملك مايكفي من المال. و الان انت على استعداد لبدء المعركة اضغط ابدأ',
				msg7: 'يمكنك ان تستعمل الاسلحة الخاصة في أي وقت تحتاجه',
				msg8: 'اضغط على المدفع لترى قدراته وتطوره أو تبيعه',
				msg9: 'واخيرا قبل انتهاء التدريب لا بد ان تعلم ان الطائرات لا تلتزم بأي مسار مرسوم بل تطير فوق كل شيء',
				msg10:'الان انت على استعداد لتدافع عن مدينتك ضد أي اعتداءات و أنا واثق من انك سوف تبذل كل الجهد لتنفيذ المهام المكلف بها. حظا موفقا'
		+'<br/>لا تنسى ان تعجب بنا و تضيفنا إلى قائمة اشاراتك لتربح جائزة جيدة'
		},
		upperBar : {
			lives: 'باقي',
			score: 'النقاط',
			wave : 'موجة'
		},
		gameState:{
			start:'ابدأ',
			pause:'اوقف',
			resume:'استأنف'
		},
		towerInfo:{
			power:'تدمير',
			shield:'القوة',
			rate: 'سرعة',
			range:'مدى',
			upgrade : "طوّر",
			sell : "بيع"
		},
		ranks:{
			PVT :{ name:'جندي' ,abbr : 'جندي'},
			LCpl:{ name:'عريف' ,abbr : 'عريف'},
			Cpl:{ name:'عريف أول' ,abbr : 'عريف أول'},
			Sgt:{ name:'صول' ,abbr : 'صول'},
			SSgt:{ name:'أمين' ,abbr : 'أمين'},
			GySgt:{ name:'رقيب' ,abbr : 'رقيب'},
			MSgt:{ name:'رقيب أول' ,abbr : 'رقيب أول'},
			'1stSgt':{ name:'مساعد' ,abbr : 'مساعد'},
			MGySgt:{ name:'مساعد أول' ,abbr : 'مساعد أول'},
			SgtMaj:{ name:'ملازم' ,abbr : 'ملازم'},
			'2ndLt':{ name:'ملازم أول' ,abbr : 'ملازم أول'},
			'1stLt':{ name:'نقيب' ,abbr : 'نقيب'},
			Capt:{ name:'رائد' ,abbr : 'رائد'},
			Maj:{ name:'مقدم' ,abbr : 'مقدم'},
			LtCol:{ name:'عقيد' ,abbr : 'عقيد'},
			Col:{ name:'عميد' ,abbr : 'عميد'},
			BGen:{ name:' لواء' ,abbr : ' لواء'},
			MajGen:{ name:'فريق' ,abbr : 'فريق'},
			LtGen:{ name:'‎ فريق أول' ,abbr : '‎ فريق أول'},
			Gen:{ name:'مشير' ,abbr : 'مشير'}
		},
		result : {
			winMission1: ' لقد نجحت في الدفاع عن',
			winMission2: ' و انقذتها من الاعداء',
			loseMission: ' سقطت في ايدي الأعداء . لا تستسلم وحاول مرة أخرى',
			coins: 'نقود',
			score: 'النقاط',
			enemies : 'اعداء',
			destroyed : 'تدمر:',
			escaped : 'هرب:',
			towers : 'مدافع',
			built : 'بني:',
			playAgain :'العب مره اخري',
			exit : 'استمر في الدفاع'
		},
		towerDestroyedCreep :[
       'من التالي؟؟!!',
       'فلتبدأ الحرب!!!',
       'عاشت تونس',
       'ألست قويا؟',
       'خذ هذا!!'
    ],
    creepDestroyedTower: [
       'هل كان هذا مدفع؟!!',
       'سندمرهم!!!',
       'ملاعيييين!!!',
       'خذ هذا!!',
        'كارثة!!!'
    ],
    superWeaponsHeal: [
       'في الوقت المناسب!',
       'شكرا!',
       'اشعر بتحسن!!'
    ],
    superWeaponsWeak: [
       'لقد وقعنا في الفخ!!!',
       'لقد وقعنا في الفخ!!!'
    ],
    superWeaponsSplash: [
       'ماهذا؟!',
       'اهرب!!',
       'صواريخ اهرب!!!!'
    ],
    superWeaponsNuke: [
       'ما.....',
       'اهر.....',
       'اااااااااه....',
       'لاااااا.....',
       'اااااااااه....'
    ],
    superWeaponsHyper: [
       'منشطات!!!',
       'رائع!!',
       'أنا سرييييع!!!',
       'منشطات!!!'
    ],
    creepEntered:[
       'سأدمركم!!',
       'اضرب!!!',
       'دمرهم!!!',
       'اسحقهم!!!'
    ],
    creepEnteredTower: [
       'فلتبدأ الحرب!!!',
       'دافع!!',
       'دافع عن ارضك!!!!',
       'هذا كل مالديك؟!'
    ],
	controls: {
		exit : 'خروج',
		reset : 'اعاده',
		like : 'اعجبني',
		bookmark : 'اضف الى قائمة اشاراتك',
		soundon : 'صوت',
		soundoff: 'بدون صوت',
		level:'المستوى',
		roger:'حسنا'
	},
	promotion: {
		msg1 : 'مبروك',
		msg2 : 'لقد تم ترقيتك و اصبحت الان ',
		okButton : 'موافق'
	}
  
  }
	
}


